app/Controllers/AdminPanelPistasClientes.php

SELECT *
FROM `pistasclientes`
SELECT *
FROM `clientes`
SELECT *
FROM `pistas`
---
    public function pistasClientes()
    {
        $pistasClientesModel = new PistasClientesModel();
        $clientesModel = new ClientesModel();
        $pistasModel = new PistasModel();

        $data['reservas'] = $pistasClientesModel->findAll();
        $data['clientes'] = $clientesModel->findAll();
        $data['pistas'] = $pistasModel->findAll();