app/Controllers/AdminPanelClientes.php

    public function clientes()
    {
        $clientesModel = new ClientesModel();
        $data['clientes'] = $clientesModel->findAll();
---
SELECT *
FROM `clientes`