app/Controllers/Clientes.php

    public function index()
    {
        $model = new ClientesModel();
        $data = $model->findAll();
---
SELECT *
FROM `clientes`

    public function create()
    {
        $model = new ClientesModel();
        $json = $this->request->getJSON(true); // Devuelve array asociativo

        if (!$json) {
            return $this->fail('No se recibió JSON válido');
        }

        log_message('debug', 'Datos recibidos para insertar: ' . json_encode($json)); // DEBUG

        if (!$model->insert($json)) {
---
INSERT INTO `clientes` (`correo`, `nombre`, `apellidos`, `fecha`, `foto`, `telefono`, `username`, `password`, `sexo`, `nivel`, `posicion`, `recibeClases`) VALUES ('borja@gmail.com', 'Borja', 'Quiñones Oliden', '2005-02-26', 'default_user.png', 645031847, 'borja', 'e670c487b6b15b81f404cbf19aedd51c38475dfa04715426e693e32a0ea92be0', NULL, 3.75, 'Revés', NULL)