app/Controllers/PistasClientes.php

SELECT *
FROM `pistasclientes`
WHERE `fechaHora` = '2025-05-30 15:00:00'
AND `idPistas` = '1'
---
    public function getJugadoresPorPista()
    {
        $fechaHora = $this->request->getGet('fechaHora');
        $idPista = $this->request->getGet('idPista');

        if (!$fechaHora || !$idPista) {
            return $this->failValidationErrors("Faltan parámetros: fechaHora o idPista");
        }

        $model = new PistasClientesModel();
        $jugadores = $model->where('fechaHora', $fechaHora)
            ->where('idPistas', $idPista)
            ->findAll();